
GetPassphraseDescription = "Du benötigst ein Passwort, um den geheimen Schlüssel von Benutzer \"%@\", ID %@ zu entsperren.";
GetPassphraseDescription_Subkey = "Du benötigst ein Passwort, um den geheimen Schlüssel von Benutzer \"%@\", ID %@, (Hauptschlüssel ID %@) zu entsperren.";
PassphraseLabel = "Passwort:";




/* For Key-Status */
"Invalid" = "Ungültig";
"Revoked" = "Widerrufen";
"Expired" = "Abgelaufen";
"Disabled" = "Deaktiviert";
"Unknown" = "Unbekannt";
"Never" = "Nie";
"Marginal" = "Marginal";
"Full" = "Vollständig";
"Ultimate" = "Absolut";


/* For Undo and Redo */
Undo_NewKey = "Schlüssel erstellen";
Undo_Delete = "Löschen";
Undo_CleanKey = "Säubern";
Undo_MinimizeKey = "Minimieren";
Undo_RevokeKey = "Schlüssel widerrufen";
Undo_ChangeExpirationDate = "Verfallsdatum ändern";
Undo_ChangePassphrase = "Passwort ändern";
Undo_AlgorithmPreferences = "Bevorzugten Algorithmus ändern";
Undo_Import = "Importieren";
Undo_AddSignature = "Beglaubigen";
Undo_RemoveSignature = "Beglaubigung entfernen";
Undo_RevokeSignature = "Beglaubigung widerrufen";
Undo_AddSubkey = "Unterschlüssel hinzufügen";
Undo_RemoveSubkey = "Unterschlüssel entfernen";
Undo_RevokeSubkey = "Unterschlüssel widerrufen";
Undo_AddUserID = "Benutzer-ID hinzufügen";
Undo_RemoveUserID = "Benutzer-ID entfernen";
Undo_RevokeUserID = "Benutzer-ID widerrufen";
Undo_PrimaryUserID = "Primäre Benutzer-ID";
Undo_AddPhoto = "Foto hinzufügen";
Undo_RefreshFromServer = " Von Server aktualisieren";
Undo_ReceiveFromServer = "Von Server abfragen";



/* Algorithm names */
CIPHER_ALGO_NONE = "Keine";
CIPHER_ALGO_IDEA = "IDEA";
CIPHER_ALGO_3DES = "3DES";
CIPHER_ALGO_CAST5 = "CAST5";
CIPHER_ALGO_BLOWFISH = "BLOWFISH";
CIPHER_ALGO_AES = "AES";
CIPHER_ALGO_AES192 = "AES192";
CIPHER_ALGO_AES256 = "AES256";
CIPHER_ALGO_TWOFISH = "TWOFISH";
CIPHER_ALGO_CAMELLIA128 = "CAMELLIA128";
CIPHER_ALGO_CAMELLIA192 = "CAMELLIA192";
CIPHER_ALGO_CAMELLIA256 = "CAMELLIA256";
DIGEST_ALGO_MD5 = "MD5";
DIGEST_ALGO_SHA1 = "SHA1";
DIGEST_ALGO_RMD160 = "RMD160";
DIGEST_ALGO_SHA256 = "SHA256";
DIGEST_ALGO_SHA384 = "SHA384";
DIGEST_ALGO_SHA512 = "SHA512";
DIGEST_ALGO_SHA224 = "SHA224";
COMPRESS_ALGO_NONE = "Keine";
COMPRESS_ALGO_ZIP = "ZIP";
COMPRESS_ALGO_ZLIB = "ZLIB";
COMPRESS_ALGO_BZIP2 = "BZIP2";

GPG_RSAAlgorithm = "RSA";
GPG_RSAEncryptOnlyAlgorithm = "RSA-E";
GPG_RSASignOnlyAlgorithm = "RSA-S";
GPG_ElgamalEncryptOnlyAlgorithm = "ELG-E";
GPG_DSAAlgorithm = "DSA";
GPG_ECDHAlgorithm = "ECDH";
GPG_ECDSAAlgorithm = "ECDSA";
GPG_ElgamalAlgorithm = "ELG";
GPG_DiffieHellmanAlgorithm = "DiffieHellman";
GPG_EdDSAAlgorithm = "EdDSA";
"Algorithm_%i" = "Algorithmus_%i";

/* GPGSignature humanReadableDescription */
"Signed" = "Signiert";
"Signature expired" = "Signatur abgelaufen";
"Key expired" = "Schlüssel abgelaufen";
"Bad signature" = "Signatur und Daten passen nicht zusammen. Eventuell wurden die Daten verändert.";
"Signature revoked" = "Signatur widerrufen";
"Signature error" = "Fehler mit der Signatur";
"Unverifiable signature" = "Signatur kann nicht verifiziert werden.";
"Signed by stranger" = "Signatur kann nicht verifiziert werden, weil der entsprechende öffentliche Schlüssel fehlt.";


/* Key Descriptions */
KeyDescriptionAndMore = "und %lu mehr";


/* Key Expiry Warning */
KeyExpiryWarning_Title = "Warnung: Dein Schlüssel läuft bald ab";
KeyExpiryWarning_Msg = "Dein Schlüssel läuft ab am%1$@:\n\n%2$@\n\nAbgelaufene Schlüssel können nicht zum Verschlüsseln oder Signieren neuer Nachrichten verwendet werden. Die Entschlüsselung wird weiterhin funktionieren. Deine Freunde können mit diesem Schlüssel keine verschlüsselten Nachrichten senden.\n\nWenn du dich dafür entscheidest, deinen Schlüssel zu verlängern, ist er für zwei weitere Jahre gültig.\n\nMöchtest du deinen Schlüssel verlängern?";
KeyExpiryWarning_Yes = "Schlüssel verlängern";
KeyExpiryWarning_No = "Abbrechen";
KeyExpiryWarning_Suppress = "Nicht erneut fragen";

SubkeyExpiryWarning_Title = "Warnung: Dein Unterschlüssel läuft bald ab";
SubkeyExpiryWarning_Msg = "Dein Unterschlüssel läuft ab am %1$@:\n\n%2$@\n\nAbgelaufene Unterschlüssel können nicht zum Verschlüsseln oder Signieren neuer Nachrichten verwendet werden. Die Entschlüsselung wird weiterhin funktionieren. Deine Freunde können mit diesem Unterschlüssel keine verschlüsselten Nachrichten senden.\n\nWenn du dich dafür entscheidest, deinen Unterschlüssel zu verlängern, ist er für zwei weitere Jahre gültig.\n\nMöchtest du deinen Unterschlüssel verlängern?";
SubkeyExpiryWarning_Yes = "Unterschlüssel verlängern";
SubkeyExpiryWarning_No = "Abbrechen";
SubkeyExpiryWarning_Suppress = "Nicht erneut fragen";

WrongPasswordTryAgain_Title = "Du hast das falsche Passwort eingegeben";
WrongPasswordTryAgain_Msg = "Willst du es noch einmal versuchen?";
WrongPasswordTryAgain_Yes = "Versuch es erneut";
WrongPasswordTryAgain_No = "Abbrechen";

KeyExpiryFailed_Title = "Der Schlüssel konnte nicht verlängert werden!";
KeyExpiryFailed_Msg = "Der Schlüssel\n%1$@\nkonnte nicht verlängert werden.\n\nFehler: %2$@";

KeyExtendedWantToUpload_Title = "Dein Schlüssel wurde erfolgreich verlängert";
KeyExtendedWantToUpload_Msg = "Damit andere das neue Ablaufdatum sehen können, ist es nötig, dass sie deinen aktualisierten Schlüssel importieren. Daher wird empfohlen, deinen aktualisierten öffentlichen Schlüssel auf die Schlüsselserver hochzuladen.\n\nWarnung: Schlüsselserver sind öffentlich, so dass der Name und die E-Mail-Adresse, die in deinem Schlüssel verwendet werden, öffentlich sichtbar sind. Schlüssel können nicht von den Schlüsselservern gelöscht werden. Sie können widerrufen, aber nicht entfernt werden.\n\nWenn du lieber keine Schlüsselserver verwenden möchtest, solltest du überlegen, deinen öffentlichen Schlüssel an deine signierten und verschlüsselten E-Mails anzuhängen.\n\nMöchtest du deinen öffentlichen Schlüssel hochladen?";
KeyExtendedWantToUpload_Yes = "Öffentlichen Schlüssel hochladen";
KeyExtendedWantToUpload_No = "Nein, Danke.";

UploadFailed_Title = "Der Schlüssel konnte nicht hochgeladen werden!";
UploadFailed_Msg = "Der Schlüssel konnte nicht auf den Schlüsselserver hochgeladen werden.\n\nFehler: %@";


UpdaterNotWorking_Title = " Der GPG Suite Updater funktioniert nicht wie erwartet!";
UpdaterNotWorking_Msg = "Bitte lade GPG Suite von https://gpgtools.org herunter und führe eine erneute Installation durch.";


SwitchToOldKeyserver_Title = "Warnung: Du bist dabei, den Schlüsselserver zu wechseln";
SwitchToOldKeyserver_Msg = "Ein Wechsel auf die alten Schlüsselserver verringert die Qualität der Suchergebnisse. Während keys.openpgp.org eine Verifikation der E-Mail Adressen ermöglicht und nur danach die E-Mail in den Suchergebnissen anzeigt, haben die alten Schlüsselserver diesen Mechanismus nicht.\n\nWir empfehlen, keys.openpgp.org weiterhin zu verwenden.\n\nMöchtest du wirklich den Schlüsselserver wechseln?";
SwitchToOldKeyserver_No = "Abbrechen";
SwitchToOldKeyserver_Yes = "Zum alten Schlüsselserver wechseln";


